app/controllers/books_controller.rb

	def create
		@book = Book.new(book_params)
		@book = current_user.books.new(book_params)
		if @book.save
		   redirect_to book_path(@book.id), notice: "You have creatad book successfully."
		else
			@books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "title_a"], ["body", "body_b"], ["user_id", 1], ["created_at", "2019-12-18 08:02:34.612257"], ["updated_at", "2019-12-18 08:02:34.612257"]]
SELECT "books".* FROM "books"